; domain
; IPC5 Domain: Storage Propositional
; Authors: Alfonso Gerevini and Alessandro Saetti 

(define (domain Storage)
(:requirements :typing)
(:types hoist surface place area - object
	container depot - place
	storearea transitarea - area
	area crate - surface)

(:predicates (clear ?s - storearea)
	     (in ?x - object ?p - place)
	     (available ?h - hoist) 
	     (lifting ?h - hoist ?c - crate) 
	     (at ?h - hoist ?a - area)
	     (on ?c - crate ?s - storearea) 
	     (connected ?a1 ?a2 - area)) 

(:action lift
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (available ?h) 
		    (on ?c ?a1) (in ?a1 ?p))
 :effect (and (not (on ?c ?a1)) (clear ?a1)
	      (not (available ?h)) (lifting ?h ?c) (not (in ?c ?p))))
				
(:action drop
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (lifting ?h ?c) 
		    (clear ?a1) (in ?a1 ?p))
 :effect (and (not (lifting ?h ?c)) (available ?h)
	      (not (clear ?a1)) (on ?c ?a1) (in ?c ?p)))

(:action move
 :parameters (?h - hoist ?from ?to - storearea)
 :precondition (and (at ?h ?from) (clear ?to) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to)) (clear ?from)))

(:action go-out
 :parameters (?h - hoist ?from - storearea ?to - transitarea)
 :precondition (and (at ?h ?from) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (clear ?from)))

(:action go-in
 :parameters (?h - hoist ?from - transitarea ?to - storearea)
 :precondition (and (at ?h ?from) (connected ?from ?to) (clear ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to))))
)

; problem
; Map of the Depots:                    
; 0000=1111         
; 0*00 11*1         
;----------         
; 0: depot0 area
; 1: depot1 area
; *: Depot access point
; =: Transit area

(define (problem storage-18)
(:domain Storage)
(:objects
	depot0-1-1 depot0-1-2 depot0-1-3 depot0-1-4 depot0-2-1 depot0-2-2 depot0-2-3 depot0-2-4 depot1-1-1 depot1-1-2 depot1-1-3 depot1-1-4 depot1-2-1 depot1-2-2 depot1-2-3 depot1-2-4 container-0-0 container-0-1 container-0-2 container-0-3 container-1-0 container-1-1 container-1-2 container-1-3 - storearea
	hoist0 hoist1 hoist2 - hoist
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	container0 container1 - container
	depot0 depot1 - depot
	loadarea transit0 - transitarea)

(:init
	(connected depot0-1-1 depot0-2-1)
	(connected depot0-1-1 depot0-1-2)
	(connected depot0-1-2 depot0-2-2)
	(connected depot0-1-2 depot0-1-3)
	(connected depot0-1-2 depot0-1-1)
	(connected depot0-1-3 depot0-2-3)
	(connected depot0-1-3 depot0-1-4)
	(connected depot0-1-3 depot0-1-2)
	(connected depot0-1-4 depot0-2-4)
	(connected depot0-1-4 depot0-1-3)
	(connected depot0-2-1 depot0-1-1)
	(connected depot0-2-1 depot0-2-2)
	(connected depot0-2-2 depot0-1-2)
	(connected depot0-2-2 depot0-2-3)
	(connected depot0-2-2 depot0-2-1)
	(connected depot0-2-3 depot0-1-3)
	(connected depot0-2-3 depot0-2-4)
	(connected depot0-2-3 depot0-2-2)
	(connected depot0-2-4 depot0-1-4)
	(connected depot0-2-4 depot0-2-3)
	(connected depot1-1-1 depot1-2-1)
	(connected depot1-1-1 depot1-1-2)
	(connected depot1-1-2 depot1-2-2)
	(connected depot1-1-2 depot1-1-3)
	(connected depot1-1-2 depot1-1-1)
	(connected depot1-1-3 depot1-2-3)
	(connected depot1-1-3 depot1-1-4)
	(connected depot1-1-3 depot1-1-2)
	(connected depot1-1-4 depot1-2-4)
	(connected depot1-1-4 depot1-1-3)
	(connected depot1-2-1 depot1-1-1)
	(connected depot1-2-1 depot1-2-2)
	(connected depot1-2-2 depot1-1-2)
	(connected depot1-2-2 depot1-2-3)
	(connected depot1-2-2 depot1-2-1)
	(connected depot1-2-3 depot1-1-3)
	(connected depot1-2-3 depot1-2-4)
	(connected depot1-2-3 depot1-2-2)
	(connected depot1-2-4 depot1-1-4)
	(connected depot1-2-4 depot1-2-3)
	(connected transit0 depot0-1-4)
	(connected transit0 depot1-1-1)
	(in depot0-1-1 depot0)
	(in depot0-1-2 depot0)
	(in depot0-1-3 depot0)
	(in depot0-1-4 depot0)
	(in depot0-2-1 depot0)
	(in depot0-2-2 depot0)
	(in depot0-2-3 depot0)
	(in depot0-2-4 depot0)
	(in depot1-1-1 depot1)
	(in depot1-1-2 depot1)
	(in depot1-1-3 depot1)
	(in depot1-1-4 depot1)
	(in depot1-2-1 depot1)
	(in depot1-2-2 depot1)
	(in depot1-2-3 depot1)
	(in depot1-2-4 depot1)
	(on crate0 container-0-0)
	(on crate1 container-0-1)
	(on crate2 container-0-2)
	(on crate3 container-0-3)
	(on crate4 container-1-0)
	(on crate5 container-1-1)
	(on crate6 container-1-2)
	(on crate7 container-1-3)
	(in crate0 container0)
	(in crate1 container0)
	(in crate2 container0)
	(in crate3 container0)
	(in crate4 container1)
	(in crate5 container1)
	(in crate6 container1)
	(in crate7 container1)
	(in container-0-0 container0)
	(in container-0-1 container0)
	(in container-0-2 container0)
	(in container-0-3 container0)
	(in container-1-0 container1)
	(in container-1-1 container1)
	(in container-1-2 container1)
	(in container-1-3 container1)
	(connected loadarea container-0-0) 
	(connected container-0-0 loadarea)
	(connected loadarea container-0-1) 
	(connected container-0-1 loadarea)
	(connected loadarea container-0-2) 
	(connected container-0-2 loadarea)
	(connected loadarea container-0-3) 
	(connected container-0-3 loadarea)
	(connected loadarea container-1-0) 
	(connected container-1-0 loadarea)
	(connected loadarea container-1-1) 
	(connected container-1-1 loadarea)
	(connected loadarea container-1-2) 
	(connected container-1-2 loadarea)
	(connected loadarea container-1-3) 
	(connected container-1-3 loadarea)  
	(connected depot0-2-2 loadarea)
	(connected loadarea depot0-2-2)
	(connected depot1-2-3 loadarea)
	(connected loadarea depot1-2-3)  
	(clear depot0-2-4)
	(clear depot0-1-2)
	(clear depot0-1-3)
	(clear depot0-1-4)
	(clear depot0-2-1)
	(clear depot0-2-2)
	(clear depot0-2-3)
	(clear depot1-2-3)
	(clear depot1-1-2)
	(clear depot1-1-3)
	(clear depot1-1-4)
	(clear depot1-2-1)
	(clear depot1-2-4)  
	(at hoist0 depot0-1-1)
	(available hoist0)
	(at hoist1 depot1-2-2)
	(available hoist1)
	(at hoist2 depot1-1-1)
	(available hoist2))

(:goal (and
	(in crate0 depot0)
	(in crate1 depot0)
	(in crate2 depot0)
	(in crate3 depot0)
	(in crate4 depot1)
	(in crate5 depot1)
	(in crate6 depot1)
	(in crate7 depot1)))

 (:metric minimize (total-time))
)

; plan
1. (move hoist0 depot0-1-1 depot0-1-2)
   deleted: (at hoist0 depot0-1-1) (clear depot0-1-2)
   added: (at hoist0 depot0-1-2) (clear depot0-1-1)
   goals met: 0 of 8
2. (move hoist1 depot1-2-2 depot1-2-3)
   deleted: (at hoist1 depot1-2-2) (clear depot1-2-3)
   added: (at hoist1 depot1-2-3) (clear depot1-2-2)
   goals met: 0 of 8
3. (go-out hoist1 depot1-2-3 loadarea)
   deleted: (at hoist1 depot1-2-3)
   added: (at hoist1 loadarea) (clear depot1-2-3)
   goals met: 0 of 8
4. (lift hoist1 crate0 container-0-0 loadarea container0)
   deleted: (on crate0 container-0-0) (available hoist1) (in crate0 container0)
   added: (clear container-0-0) (lifting hoist1 crate0)
   goals met: 0 of 8
5. (drop hoist1 crate0 depot0-2-2 loadarea depot0)
   deleted: (lifting hoist1 crate0) (clear depot0-2-2)
   added: (available hoist1) (on crate0 depot0-2-2) (in crate0 depot0)
   goals met: 1 of 8
6. (lift hoist0 crate0 depot0-2-2 depot0-1-2 depot0)
   deleted: (on crate0 depot0-2-2) (available hoist0) (in crate0 depot0)
   added: (clear depot0-2-2) (lifting hoist0 crate0)
   goals met: 0 of 8
7. (lift hoist1 crate3 container-0-3 loadarea container0)
   deleted: (on crate3 container-0-3) (available hoist1) (in crate3 container0)
   added: (clear container-0-3) (lifting hoist1 crate3)
   goals met: 0 of 8
8. (go-in hoist1 loadarea depot0-2-2)
   deleted: (at hoist1 loadarea) (clear depot0-2-2)
   added: (at hoist1 depot0-2-2)
   goals met: 0 of 8
9. (move hoist1 depot0-2-2 depot0-2-3)
   deleted: (at hoist1 depot0-2-2) (clear depot0-2-3)
   added: (at hoist1 depot0-2-3) (clear depot0-2-2)
   goals met: 0 of 8
10. (drop hoist1 crate3 depot0-2-4 depot0-2-3 depot0)
   deleted: (lifting hoist1 crate3) (clear depot0-2-4)
   added: (available hoist1) (on crate3 depot0-2-4) (in crate3 depot0)
   goals met: 1 of 8
11. (move hoist1 depot0-2-3 depot0-2-2)
   deleted: (at hoist1 depot0-2-3) (clear depot0-2-2)
   added: (at hoist1 depot0-2-2) (clear depot0-2-3)
   goals met: 1 of 8
12. (go-out hoist1 depot0-2-2 loadarea)
   deleted: (at hoist1 depot0-2-2)
   added: (at hoist1 loadarea) (clear depot0-2-2)
   goals met: 1 of 8
13. (lift hoist1 crate1 container-0-1 loadarea container0)
   deleted: (on crate1 container-0-1) (available hoist1) (in crate1 container0)
   added: (clear container-0-1) (lifting hoist1 crate1)
   goals met: 1 of 8
14. (move hoist0 depot0-1-2 depot0-2-2)
   deleted: (at hoist0 depot0-1-2) (clear depot0-2-2)
   added: (at hoist0 depot0-2-2) (clear depot0-1-2)
   goals met: 1 of 8
15. (drop hoist0 crate0 depot0-1-2 depot0-2-2 depot0)
   deleted: (lifting hoist0 crate0) (clear depot0-1-2)
   added: (available hoist0) (on crate0 depot0-1-2) (in crate0 depot0)
   goals met: 2 of 8
16. (go-out hoist0 depot0-2-2 loadarea)
   deleted: (at hoist0 depot0-2-2)
   added: (at hoist0 loadarea) (clear depot0-2-2)
   goals met: 2 of 8
17. (lift hoist0 crate5 container-1-1 loadarea container1)
   deleted: (on crate5 container-1-1) (available hoist0) (in crate5 container1)
   added: (clear container-1-1) (lifting hoist0 crate5)
   goals met: 2 of 8
18. (go-in hoist0 loadarea depot1-2-3)
   deleted: (at hoist0 loadarea) (clear depot1-2-3)
   added: (at hoist0 depot1-2-3)
   goals met: 2 of 8
19. (move hoist0 depot1-2-3 depot1-2-4)
   deleted: (at hoist0 depot1-2-3) (clear depot1-2-4)
   added: (at hoist0 depot1-2-4) (clear depot1-2-3)
   goals met: 2 of 8
20. (move hoist0 depot1-2-4 depot1-1-4)
   deleted: (at hoist0 depot1-2-4) (clear depot1-1-4)
   added: (at hoist0 depot1-1-4) (clear depot1-2-4)
   goals met: 2 of 8
21. (drop hoist0 crate5 depot1-2-4 depot1-1-4 depot1)
   deleted: (lifting hoist0 crate5) (clear depot1-2-4)
   added: (available hoist0) (on crate5 depot1-2-4) (in crate5 depot1)
   goals met: 3 of 8
22. (go-in hoist1 loadarea depot0-2-2)
   deleted: (at hoist1 loadarea) (clear depot0-2-2)
   added: (at hoist1 depot0-2-2)
   goals met: 3 of 8
23. (drop hoist1 crate1 depot0-2-1 depot0-2-2 depot0)
   deleted: (lifting hoist1 crate1) (clear depot0-2-1)
   added: (available hoist1) (on crate1 depot0-2-1) (in crate1 depot0)
   goals met: 4 of 8
24. (go-out hoist1 depot0-2-2 loadarea)
   deleted: (at hoist1 depot0-2-2)
   added: (at hoist1 loadarea) (clear depot0-2-2)
   goals met: 4 of 8
25. (lift hoist1 crate4 container-1-0 loadarea container1)
   deleted: (on crate4 container-1-0) (available hoist1) (in crate4 container1)
   added: (clear container-1-0) (lifting hoist1 crate4)
   goals met: 4 of 8
26. (drop hoist1 crate4 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist1 crate4) (clear depot1-2-3)
   added: (available hoist1) (on crate4 depot1-2-3) (in crate4 depot1)
   goals met: 5 of 8
27. (lift hoist1 crate2 container-0-2 loadarea container0)
   deleted: (on crate2 container-0-2) (available hoist1) (in crate2 container0)
   added: (clear container-0-2) (lifting hoist1 crate2)
   goals met: 5 of 8
28. (drop hoist1 crate2 depot0-2-2 loadarea depot0)
   deleted: (lifting hoist1 crate2) (clear depot0-2-2)
   added: (available hoist1) (on crate2 depot0-2-2) (in crate2 depot0)
   goals met: 6 of 8
29. (lift hoist1 crate7 container-1-3 loadarea container1)
   deleted: (on crate7 container-1-3) (available hoist1) (in crate7 container1)
   added: (clear container-1-3) (lifting hoist1 crate7)
   goals met: 6 of 8
30. (move hoist0 depot1-1-4 depot1-1-3)
   deleted: (at hoist0 depot1-1-4) (clear depot1-1-3)
   added: (at hoist0 depot1-1-3) (clear depot1-1-4)
   goals met: 6 of 8
31. (lift hoist0 crate4 depot1-2-3 depot1-1-3 depot1)
   deleted: (on crate4 depot1-2-3) (available hoist0) (in crate4 depot1)
   added: (clear depot1-2-3) (lifting hoist0 crate4)
   goals met: 5 of 8
32. (drop hoist1 crate7 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist1 crate7) (clear depot1-2-3)
   added: (available hoist1) (on crate7 depot1-2-3) (in crate7 depot1)
   goals met: 6 of 8
33. (drop hoist0 crate4 depot1-1-4 depot1-1-3 depot1)
   deleted: (lifting hoist0 crate4) (clear depot1-1-4)
   added: (available hoist0) (on crate4 depot1-1-4) (in crate4 depot1)
   goals met: 7 of 8
34. (lift hoist1 crate6 container-1-2 loadarea container1)
   deleted: (on crate6 container-1-2) (available hoist1) (in crate6 container1)
   added: (clear container-1-2) (lifting hoist1 crate6)
   goals met: 7 of 8
35. (lift hoist0 crate7 depot1-2-3 depot1-1-3 depot1)
   deleted: (on crate7 depot1-2-3) (available hoist0) (in crate7 depot1)
   added: (clear depot1-2-3) (lifting hoist0 crate7)
   goals met: 6 of 8
36. (drop hoist1 crate6 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist1 crate6) (clear depot1-2-3)
   added: (available hoist1) (on crate6 depot1-2-3) (in crate6 depot1)
   goals met: 7 of 8
37. (drop hoist0 crate7 depot1-1-2 depot1-1-3 depot1)
   deleted: (lifting hoist0 crate7) (clear depot1-1-2)
   added: (available hoist0) (on crate7 depot1-1-2) (in crate7 depot1)
   goals met: 8 of 8
